[{"uid":"2017-06-21T16:49:24","updateDate":"2018-03-31T22:08:33","titleText":"What I learned about hiring professionals by cutting my own hair","mainText":"\nBlog\nLatest news and information direct from our laboratory.\n\nThis weekend I had the brilliant idea to cut my hair myself, in the mirror. I looked at my problems with my hair maintenance, and thought, if I can do this myself it would save me time and money.\nSo, you’re probably thinking from the title that it didn’t go so well. While that is true, I was able to turn this into a business related lesson.\nAbout three buzzes in, I knew I was too deep into it to turn back.\n \nLet’s break down the psychology of a haircut. \nYour hair is a major player in how you are perceived when meeting or communicating in person with people.\nIt is a part of your unique brand (you). It can convey modern, classic, edgy, or funky styling. It can give us a window into your personality.\nA Hairstyle also can provide creditability to your character. Is it neat, is it clean, is it managed well?\nWhen your hair is on point, it can convey confidence.\nPut this scenario in the context of your business and all the visual collateral you use to send your message to your market. Business cards, flyers, email, Facebook Ads, and your Website to name a few.\n\nHave you tried to “cut your own hair”?\n \nWhat I learned trying it myself is that it will cost more to fix it.\nI spent a time to do it myself. Now, I will have to spend time\/money to fix it. Ultimately, time and money were the problems I was trying to solve. Now, I have managed to double it.\nSome of the mistakes will have to wait until my hair grows out to fix. That is a delay. Again, more time I wasted.\nIf I had hired a professional in the first place, it would have been a minor time delay and slightly more cost up front. I would have had a great haircut and no worries about my brand or creditability.\nThis story is just a pleasant reminder to think twice about going DIY when working with the credibility and overall brand of your business.\n\nI am the owner of CarbonBased Creative. We are a small multidisciplinary creative studio focused on building your business.\n\nDo you think we’re a good fit?\nIf you feel I’m a good match for your next project, I would love to hear about it.\nGet in Touch\n","redirectionUrl":"http:\/\/localhost:8888\/carbonbased-live\/blog\/cutting-my-own-hair\/"},{"uid":"2017-05-12T16:24:54","updateDate":"2018-03-31T20:26:40","titleText":"Move it in, round it up","mainText":"\nBlog\nLatest news and information direct from our laboratory.\n\nDo you feel like the development is moving a million miles a minute?\nWith so many new approaches and new tools coming out all the time, I like to put together a grouping of interesting articles and concepts from around the web.\nQuick plug: I will be at the Colorado Springs Web Professionals Meetup next week (5\/17) talking about SVG animation with CSS. Check it out!\n\n\nThis is a great article explaining the differences with CSS animation and Javascript animation.\n\nCSS Animations vs the Web Animations API: A Case Study\n\n“As with last week, I’ll start this off with an introduction to the Web Animations API. The Web Animations API provides a way for developers to directly manipulate the browser’s animation engine using JavaScript.”\n\nClick here to Read\n\n\nI had a chance to watch this course on Lynda.com. (Free with a Pikes Peak Library District Card)\nRay Villalobos uses Bootstrap and Handlebars.js to walk through the basics of building a PWA\nBuilding a Progressive Web App\n\n“Native apps do things like work offline and load on a device’s home screen. Until now, mobile web apps accessed in a browser lacked those features.”\n\nClick here to Learn More\n\n\nManage app state …\nManaging State in CSS with Reusable JavaScript Functions\n\nVery nice!\n I am the owner of CarbonBased Creative. We are a small multidisciplinary creative studio focused on building your business. \nDo you think we’re a good fit?\nIf you feel we are a good match for your next project, we would love to hear about it.\nContact Us\n","redirectionUrl":"http:\/\/localhost:8888\/carbonbased-live\/blog\/move-it-in-round-it-up\/"},{"uid":"2017-04-21T17:44:50","updateDate":"2018-03-31T20:26:55","titleText":"Which comes first, working hard or working smart?","mainText":"\nBlog\nLatest news and information direct from our laboratory.\n\n\n\nEvery day new questions trend throughout the internet. In a recent debate, the question popped up. Is it better to work hard or work smarter?\nI remember the first time I was introduced to the concept. I was around eight years old watching “Ducktales.” For those who don’t know it was an after school cartoon that ran from 1987-1990. I mostly watched it because it was a cartoon and didn’t pay much mind to the content. The cartoon was peppered with entrepreneurial advice from one of the main characters, Scrooge McDuck. The scene below is probably the first time I had any thoughts of what problem-solving was.\nMy answer to the question, I think it often takes a lot of hard work to figure out how to work smart. At the same time, it is not linear and is under constant evaluation.\nWhen working hard, you’re in the weeds and can’t see the larger picture. You feel friction at certain points in your process, but to complete a task, you don’t have time to alter it.\n\nDo you ask yourself: \nWhy does our business do x,y,z?\n \nI ask myself these questions every day about everything. Sometimes I have breakthroughs; often I don’t.\nHere are a few ideas to help you find “smarter” solutions to any process. These are simple but serve as an excellent reminder for businesses, creatives, and programmers.\n \n\nStop Procrastinating\nAnalysis paralysis is a real thing. This is a major factor with all the information that is available to us at any given moment. You can’t do everything at once. You are best served to go after your top priorities.\nInspect those priorities for pain points. Then break down each step to find issues.\nGet to work!\n \n\nReverse the Flow\nIf you are used to going after things from a top-down perspective shift it and try to look at it from the bottom up.\nI attend a yoga class semi-regularly. There’s a portion of sun salutations that is consistent from class to class. In one class it was reversed. It threw me off and made me focus on what the actual poses were. I realized I was in cruise control with that flow.\n \n\nReframe the Problem\nYou are so familiar with your process that you think you are working smarter. Now reframe the process. There is a method in an art called upside down drawing. In it, you often draw what you think you see as opposed to what is there.\nThis can be applied to optimizing your process.\n \n\nBreathe\nAlways take the time to breathe. It is a great way to think deeply and calms down.\n \n \n\n\n\n\n\nI am the owner of CarbonBased Creative. We are a small multidisciplinary creative studio focused on building your business.\n\n\n\n\nDo you think we’re a good fit?\nIf you feel we are a good match for your next project, we would love to hear about it.\nContact Us\n","redirectionUrl":"http:\/\/localhost:8888\/carbonbased-live\/blog\/comes-first-working-hard-working-smart\/"}]